IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 EDAD PIC 99.
PROCEDURE DIVISION.
    SET EDAD TO 14.

    IF EDAD > 18
        DISPLAY "ERES MAYOR"
    ELSE
         DISPLAY "ERES MENOR"
    END-IF.

STOP RUN.