IDENTIFICATION DIVISION.
PROGRAM-ID. ERES_MAYOR.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-EDADUNO PIC 9(3).
   01 WS-EDADOS PIC 9(2).

PROCEDURE DIVISION.
    MOVE 25 TO WS-EDADUNO.
    MOVE 15 TO WS-EDADOS.

    DISPLAY 'TU EDAD ES 'WS-EDADUNO.

    IF WS-EDADUNO > 18 THEN
       DISPLAY 'ERES MAYOR'
    ELSE
       DISPLAY 'ERES MENOR'
    END-IF.

    DISPLAY 'TU EDAD ES ' WS-EDADOS.

    IF WS-EDADOS > 18 THEN
       DISPLAY 'ERES MAYOR'
    ELSE
       DISPLAY 'ERES MENOR'
    END-IF.

STOP RUN.

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NAME PIC A(30).
   01 WS-ID PIC 9(5) VALUE '12345'.

PROCEDURE DIVISION.
   A000-FIRST-PARA.
   DISPLAY 'Hello World'.
   MOVE 'mario peña' TO WS-NAME.
   DISPLAY "My name is : "WS-NAME.
   DISPLAY "My ID is : "WS-ID.
STOP RUN.